# Pandas 
   # > Topic:1 Series

In [2]:
import numpy as np
import pandas as pd

In [15]:
#1. Creating a series
labels = ['a','b','c']
Notions = ['Muskan','Jay','Geeta']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b':20, 'c':30}

In [16]:
pd.Series(data = my_data) #S in uppercase

0    10
1    20
2    30
dtype: int64

In [17]:
#Changing the index as per our needs
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(arr,Notions)

Muskan    10
Jay       20
Geeta     30
dtype: int32

In [20]:
pd.Series(d) #Using dict. with series in Pandas, || uses keys=indexes, uses values=series||

a    10
b    20
c    30
dtype: int64

In [33]:
#Series with Built in functions

Jay = pd.Series(data = sum(my_data))
Jay

0    60
dtype: int64

In [34]:
#2 ----------------------- Extract value from series
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Poland'])
ser2 = pd.Series([1,2,3,5],['USA','Germany','USSR','Italy'])

In [35]:
ser1

USA        1
Germany    2
USSR       3
Poland     4
dtype: int64

In [36]:
ser2

USA        1
Germany    2
USSR       3
Italy      5
dtype: int64

In [40]:
ser2['Italy'] #Extracting the value from series, using INDEX Value

5

In [47]:
#3----------------- [Arithmatic Operators with Series]

##(NOTE: #Only Includes & Perform arithematic Operations with the Intersect points of All series in addition, 
         #and shows NaN for the points not intersecting with all the series)

In [48]:
ser3 = pd.Series([1,2,6,5],['USA','Germany','India','Italy'])
ser3

USA        1
Germany    2
India      6
Italy      5
dtype: int64

In [49]:
ser1 + ser2 + ser3

Germany    6.0
India      NaN
Italy      NaN
Poland     NaN
USA        3.0
USSR       NaN
dtype: float64

In [50]:
ser1 * ser2

Germany    4.0
Italy      NaN
Poland     NaN
USA        1.0
USSR       9.0
dtype: float64

In [51]:
#NOTE: Whenever performing Operations in Pandas Series, almost all the integers INT turn to FLOAT

# >Topic 2: DataFrames- 1

In [53]:
import numpy as np
import pandas as pd
from numpy.random import randn #To import normal distribution random numbers from numpy in random repository

In [54]:
np.random.seed(101) #NOTE: '.seed()' is used to makesure same random numbers are obtained in each operation

#SYNTAX(using pandas fn): df = pf.DataFrame(pd_fun(row_nos.,col_nos.),[Index_values],[col_names])-------------------------------
#>(using randn fn): df = pf.DataFrame(randn(row_nos.,col_nos.),[Index_values],[col_names])

In [59]:
#1.Create a normal dataframe for RANDN values
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [62]:
#NOTE: Dataframe is a bunch of series with common INDEX values

In [86]:
#2.Indexing & Selecting for DF
df['W']['A']  #SYNTAX(Indexing in DataFrame for "a specific value"): df_name[col_name][row_name] OR df.loc[row_name,col_name]
             #SYNTAX(Selecting in df for "N cols. DF""): df_name[[col_1,col_2..]]
             ##SYNTAX(Selecting in df for "N rows. DF""): df_name.loc[[row_1,row_2..]] OR #df_name.iloc[index_value]

0.3860303121135517

In [68]:
df[['W','X']]

          W         X
A  0.386030  2.084019
B  0.681209  1.035125
C -1.005187 -0.741790
D -1.382920  1.482495
E  0.992573  1.192241

In [71]:
#3. Creating a new column from existing columns (Using Arithematic ops)

df['New'] = df['W'] + df['X']
df

          W         X         Y         Z       new       New
A  0.386030  2.084019 -0.376519  0.230336  2.470049  2.470049
B  0.681209  1.035125 -0.031160  1.939932  1.716334  1.716334
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977 -1.746977
D -1.382920  1.482495  0.961458 -2.141212  0.099575  0.099575
E  0.992573  1.192241 -1.046780  1.292765  2.184814  2.184814

In [74]:
df['Div_of_X&Y'] = df['X']/df['Y']
df

          W         X         Y         Z       new       New  Div_of_X&Y
A  0.386030  2.084019 -0.376519  0.230336  2.470049  2.470049   -5.534967
B  0.681209  1.035125 -0.031160  1.939932  1.716334  1.716334  -33.219162
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977 -1.746977   -3.964150
D -1.382920  1.482495  0.961458 -2.141212  0.099575  0.099575    1.541924
E  0.992573  1.192241 -1.046780  1.292765  2.184814  2.184814   -1.138961

In [75]:
#4. Drop a column
#SYNTAX(for col): df.drop(col_name,axis=1) || for rows: df.drop(row_name,axis=0)

In [79]:
df.drop('new',axis=1)

          W         X         Y         Z       New  Div_of_X&Y
A  0.386030  2.084019 -0.376519  0.230336  2.470049   -5.534967
B  0.681209  1.035125 -0.031160  1.939932  1.716334  -33.219162
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977   -3.964150
D -1.382920  1.482495  0.961458 -2.141212  0.099575    1.541924
E  0.992573  1.192241 -1.046780  1.292765  2.184814   -1.138961

In [80]:
df #NOTE: #Note: Any function in DataFrame(PANDAS) doesn't affect the actual DataFrame, it just gives a modified view,
                 #To actually make changes in the initial DataFrame as well, use 'inplace = True' 
                 #  || to avoid changes in initial DF use 'inplace = False'

          W         X         Y         Z       new       New  Div_of_X&Y
A  0.386030  2.084019 -0.376519  0.230336  2.470049  2.470049   -5.534967
B  0.681209  1.035125 -0.031160  1.939932  1.716334  1.716334  -33.219162
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977 -1.746977   -3.964150
D -1.382920  1.482495  0.961458 -2.141212  0.099575  0.099575    1.541924
E  0.992573  1.192241 -1.046780  1.292765  2.184814  2.184814   -1.138961

In [81]:
df.drop('new',axis=1,inplace = True)

In [82]:
df

          W         X         Y         Z       New  Div_of_X&Y
A  0.386030  2.084019 -0.376519  0.230336  2.470049   -5.534967
B  0.681209  1.035125 -0.031160  1.939932  1.716334  -33.219162
C -1.005187 -0.741790  0.187125 -0.732845 -1.746977   -3.964150
D -1.382920  1.482495  0.961458 -2.141212  0.099575    1.541924
E  0.992573  1.192241 -1.046780  1.292765  2.184814   -1.138961

### @Why row -->> axis=0 & col -->> axis=1 ?? 
#Ans: Bcoz in Numpy, row_no is at a ZERO axis place and col_no is at a ONES axis place

In [84]:
#5 Select ROW in DF
df.loc[['A','B']]

          W         X         Y         Z       New  Div_of_X&Y
A  0.386030  2.084019 -0.376519  0.230336  2.470049   -5.534967
B  0.681209  1.035125 -0.031160  1.939932  1.716334  -33.219162

In [85]:
df.iloc[2]

W            -1.005187
X            -0.741790
Y             0.187125
Z            -0.732845
New          -1.746977
Div_of_X&Y   -3.964150
Name: C, dtype: float64

In [89]:
#6 Subset of row and col

df.loc['B','Z']

1.9399323109926203

In [90]:
df.loc[['A','B'],['X','Z']]

          X         Z
A  2.084019  0.230336
B  1.035125  1.939932

In [91]:
#SYNTAX(Indexing in DataFrame for "a specific value"): df_name[col_name][row_name] OR df.loc[row_name,col_name]

#SYNTAX(Selecting in df for "N rows. DF""): df_name.loc[[row_1,row_2..]] OR #df_name.iloc[index_value]

#---------SUBSET
#SYNTAX(Subset in DF of multiple rows and col: df.loc[[row_1,row_],[col_1,col_2]]
#SYNTAX(Subset in DF of multiple rows and col(using INdex values): df.iloc[[row_index_1,row_index_2],[col_index_1,col_index_2]]

In [92]:
df.iloc[[2,3],[1,2]]

          X         Y
C -0.741790  0.187125
D  1.482495  0.961458

# >Topic 3:DataFrames-2

In [93]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [94]:
np.random.seed(101)

In [95]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### 1. Conditional Selection

In [96]:
#NOTE: Similar to Numpy, using Condn. Operations in PANDAS gives Boolean Values || 
#SYNTAX: df_name[condition]--> Gives only TRUE values and NaN for FALSE, when entire data set in use

In [98]:
#1 Drill for conditional operators
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [129]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
#>>>>Alternative:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
#2. Condition on a specified Cols. or Rows         #NOTE: return only True values and not null(coz whole DF isn't in use)

In [103]:
df['W']>0 #C has false

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [104]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [107]:
#3. Specific the Return Value after CONDITION is met
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [108]:
#SYNTAX(For condition on column and 1 specific return value): df_name[df_name[col_name]cond.][return_value_name]
#SYNTAX(For condition on column and N specific return value): df_name[df_name[col_name]cond.][[return_value_nameS]]

In [109]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [110]:
#{IMP}LIMITATION: AND, OR operator in Python , can only handle one instance of Boolean values at a time and not multiple
          #So to apply multiple conditions for a o/p '&' is used instead of 'AND' 
          # '|' instead of 'OR'
    
#SYNTAX(Multiple Conds. in DF): df_name[(df_name[col or row]cond.) & (df_name[col or row]cond.) & ........]

In [111]:
#4. Applying Multiple Conditions ( & Operator)
df[(df['W']>0) & (df['X']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [113]:
df[(df['W']<1) & (df['X']<0) & (df['Y']<0) & (df['Z']<0.7)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965

In [115]:
#4b (OR operator = |)
df[(df['W']<0 | (df['X']>1))]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

### 2.Indexing

In [116]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [117]:
#1. Reset the index value(SYNTAX)
df.reset_index() #Can use inplace=true, to change the df permanently

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [118]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [119]:
#2. Setting up a index
#SYNTAX: df.set_index(new_index)

In [120]:
newind = 'CA NY IN LA PO'.split() #Quick method to get a list

In [121]:
newind

['CA', 'NY', 'IN', 'LA', 'PO']

In [122]:
df['States'] = newind

In [123]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     IN
D  0.188695 -0.758872 -0.933237  0.955057     LA
E  0.190794  1.978757  2.605967  0.683509     PO

In [124]:
#Set states as index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
IN     -2.018168  0.740122  0.528813 -0.589001
LA      0.188695 -0.758872 -0.933237  0.955057
PO      0.190794  1.978757  2.605967  0.683509

In [125]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     IN
D  0.188695 -0.758872 -0.933237  0.955057     LA
E  0.190794  1.978757  2.605967  0.683509     PO

In [127]:
df.drop('States',axis=1, inplace=True)

In [128]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# > Topic4:DataFrames-3

In [130]:
import numpy as np
import pandas as pd

### 1.MultiIndex

In [140]:
#1. INDEX Levels
#Create Multi Index DataFrame
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))#zip: used to make a list of tuple pairs including data from 2 attributes
hier_index = pd.MultiIndex.from_tuples(hier_index) #Gives you Multi-Indexes at different lvl. in form of Tuples

In [142]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [143]:
#2. Naming the indexes (SYNTAX)
df.index.names = ['Groups','Sr.No.']

In [144]:
df

                      A         B
Groups Sr.No.
G1     1       1.025984 -0.156598
       2      -0.031579  0.649826
       3       2.154846 -0.610259
G2     1      -0.755325 -0.346419
       2       0.147027 -0.479448
       3       0.558769  1.024810

In [148]:
#3. Calling out values from MultiIndex DF
#SYNTAX('Calling out values from MultiIndex'): df.loc[outer_ind].loc[inner_ind].loc[col_name])
df.loc['G1'].loc[1].loc['A']

1.025984152081572

### 2.Crosssection

In [149]:
#-----IMPNOTE---: In MULTIINDEX, using 'xs' --> Crosssection can avoid repetitive use of 'loc' || It can penetrate the df easily
#SYNTAX('xs' in Multiindex): df_name.xs(index_value,level = 'Name_of_index')

In [150]:
df.xs(1,level = 'Sr.No.')

               A         B
Groups
G1      1.025984 -0.156598
G2     -0.755325 -0.346419

# >Topic-5 Missing Values

In [151]:
#Note: In Pandas, it automatically fills out the missing values with NaN
#np.nan --> To signify missing or null value in the code

In [152]:
import numpy as np
import pandas as pd

In [153]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [154]:
df = pd.DataFrame(d)

In [155]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### 1. Dropping off Null Values

In [157]:
#--Note #df.dropna() --> Drops the entire row, even with 1 null value(coz axis=0 is default)
        #df.dropna(axis=1) --> Drops the entire column, even with 1 null value
        #df.dropna(axis=,thresh=) -- 'Thresh' symbolizes the condition required for minimum Non null values before drop

In [158]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [159]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [160]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

### 2. Fill  Null Values

In [162]:
df.fillna('Jay')

     A    B  C
0  1.0  5.0  1
1  2.0  Jay  2
2  Jay  Jay  3

In [163]:
#Excercise: fill mean at null value of A column
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [164]:
#SYNTAX(To fill a specific null value): df_name[col].fillna[new_value]
#SYNTAX(To fill a specific null value using function): df_name[col].fillna[df_name[col].fun()]

In [166]:
df['A'].fillna('Baby')

0     1.0
1     2.0
2    Baby
Name: A, dtype: object

# Topic-6 : Group-By

In [168]:
#Note: Group By allows you to group together rows based off of a column and perform an aggregate function on them
#SYNTAX(To form group by): df_name.groupby(by='col',axis= ).fun().loc('col or row')  
#-- .loc used to locate a specific o/p (IF REQ) 
# func()= describe() --> Gives all the stats
# .transpose() --> used to interchange row and column

In [169]:
import numpy as np
import pandas as pd

In [171]:
#1.Create a DataFrame
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [172]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [176]:
bycomp = df.groupby(by='Company',axis=0)

In [174]:
#NOTE: Now after groupby operations, that object formed so assign a var to it, 
      #can be worked with Aggregate functions and desired o/p will be generated

In [177]:
bycomp

In [178]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [182]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [184]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [186]:
bycomp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Topic-7: Merging, Joining, & Concatenating

### 1.Concatenate
#### Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. 
#### You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [187]:
#NOTE: 
import numpy as np
import pandas as pd

In [188]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [189]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [190]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [191]:
#SYNTAX(Concatenate): pd.concat([dataframe_names],axis= )

In [193]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [194]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### 2. Merge

In [195]:
#SYNTAX: 
#(Merge With 1 or multi connector)  pd.merge(left_df,right_df,how = 'inner' / 'outer'/'left' / 'right',on = ['Connector_nameS'])
#-- dir_on = left_on or right_on --Connector =  common column
# 1st df = left || 2nd df = right
# 'inner': Only includes records W/0 Null values
# 'outer': includes all records (with Null also)

In [205]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [206]:
pd.merge(left,right,how='inner',on = ['key'])

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [207]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [208]:
pd.merge(left,right,how='inner',on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [209]:
pd.merge(left,right,how='outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [215]:
pd.merge(left,right,how='left',on = ['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### 3. Join
#### Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [216]:
#SYNTAX(JOIN): df_name1.join(df_name2, how = 'inner' / 'outer'/'left' / 'right')
#Note: Here instead of Key, join using Indexes

In [217]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [218]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Topic 7: Pandas Operations

In [219]:
import numpy as np
import pandas as pd

In [283]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### a.) unique() || nunique() || value_counts()

In [244]:
#unique() is used to find unique values in any col or row
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [245]:
#nunique() used to find number of unique values
df['col2'].nunique()

3

In [246]:
#value_counts() used to find occurence no. of  each unique value
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

#### b.) Selecting practice

In [247]:
df[(df['col1']>2) & (df['col2']>389) ]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

#### c.) Apply()

In [248]:
#This function is used to broadcast the (user defined or built in) function with dataframes, 
#in order to modify the value, such as sum(),max(),babylove()
#SYNTAX: df_name[col_name].apply(u_fun or fun)

In [249]:
def baby(x):
    return x*2+1

In [252]:
df['col1'].apply(baby)

0    3
1    5
2    7
3    9
Name: col1, dtype: int64

In [254]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

#### d.) drop() || columns || index || sort_values(by= ,axis=) || isnull()

In [255]:
df.drop('col2',axis=1,inplace = False)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [256]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [258]:
#To get details abt columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [259]:
#To get details abt indexes
df.index

RangeIndex(start=0, stop=4, step=1)

In [261]:
#To sort the values
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [264]:
#To find bool o/p for null value present in DF
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### e.) PIVOT tables

In [267]:
#SYNTAX(Pivot tables) = df_name.pivot_table(values=col_name, index = [col_names], columns = [col_names])

In [268]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [269]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [280]:
#Creating a pivot with Multiindex DF
A = df.pivot_table(values='D',index=['A','B'],columns=['C'])

In [281]:
A.isnull()

C            x      y
A   B
bar one  False  False
    two   True  False
foo one  False  False
    two  False   True

# Topic-8 : Data I/P & O/P

#### CSV / EXCEL / HTML / SQL

In [285]:
import pandas as pd

In [286]:
pwd #To check the location of file

'C:\\Users\\jay.guwalani\\Desktop\\Data Scientist\\Resources\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

##### 1. CSV

In [8]:
# Create a DF with existing CSV file
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [292]:
#Change its label
df.to_csv('My_OP',index=False) # NOTE: Index=false saves original index from "Getting saved as a column"

In [294]:
pd.read_csv('My_OP')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### 2. Excel

In [299]:
 pd.read_excel('Excel_Sample.xlsx', 'Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [300]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

#### 3. HTML

In [3]:
import pandas as pd
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html', flavor='html5lib')
#Pandas tries to read all the tables available in html dataset
data[0].head()  #Will give first 5 records of Page '0' of HTML web

ValueError: No tables found

#### 4.SQL

In [4]:
#pi mysql library is used for MySQL

In [5]:
from sqlalchemy import create_engine

In [6]:
engine = create_engine('sqlite:///:memory:')

In [9]:
df.to_sql('data', engine)

In [11]:
sql_df = pd.read_sql('data',con=engine)

In [12]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15